In [7]:
import sqlite3
import pandas as pd

from helpers import tap_request, clean_data

## connect

In [20]:
conn = sqlite3.connect("../database.db")
# conn = sqlite3.connect("test_database.db")
cursor = conn.cursor()

In [23]:
conn.execute("""
    ALTER TABLE planetary_systems
    RENAME TO planets;
""")

## Planetary Systems

### Delete

In [9]:
# conn.execute("""DROP TABLE IF EXISTS planets""")

### Create

In [10]:
# conn.execute("""
# CREATE TABLE planets (
#     pl_name TEXT PRIMARY KEY NOT NULL,
#     hostname TEXT,
#     sy_snum INTEGER,
#     sy_pnum INTEGER,
#     cb_flag INTEGER,
#     disc_pubdate INTEGER,
#     last_updated DATETIME DEFAULT current_timestamp
# );
# """)

### Checks

##### Table Meta Data

In [12]:
pd.read_sql_query("""PRAGMA table_info('planets');""", conn)

   cid          name      type  notnull         dflt_value  pk
0    0       pl_name      TEXT        1               None   1
1    1      hostname      TEXT        0               None   0
2    2       sy_snum   INTEGER        0               None   0
3    3       sy_pnum   INTEGER        0               None   0
4    4       cb_flag   INTEGER        0               None   0
5    5  disc_pubdate   INTEGER        0               None   0
6    6  last_updated  DATETIME        0  current_timestamp   0

##### All

In [13]:
pd.read_sql_query("""SELECT * FROM planets""", conn)

,pl_name,hostname,sy_snum,sy_pnum,cb_flag,disc_pubdate,last_updated
0,11 Com b,11 Com,2,1,0,2008-01,2024-12-17 11:43:50
1,11 UMi b,11 UMi,1,1,0,2009-10,2024-12-17 11:43:50
2,14 And b,14 And,1,1,0,2008-12,2024-12-17 11:43:50
3,14 Her b,14 Her,1,2,0,2003-01,2024-12-17 11:43:50
4,16 Cyg B b,16 Cyg B,3,1,0,1997-07,2024-12-17 11:43:50
...,...,...,...,...,...,...,...
5814,TOI-4504 b,TOI-4504,1,3,0,2024-12,2025-01-15 10:32:46
5815,TOI-4504 c,TOI-4504,1,3,0,2024-12,2025-01-15 10:32:46
5816,TOI-4504 d,TOI-4504,1,3,0,2024-12,2025-01-15 10:32:46
5817,TOI-5688 A b,TOI-5688 A,2,1,0,2024-09,2025-01-15 10:32:46
5818,TOI-6383 A b,TOI-6383 A,2,1,0,2024-12,2025-01-15 10:32:46

##### Count

In [14]:
pd.read_sql_query("SELECT COUNT(pl_name) FROM planets", conn)

   COUNT(pl_name)
0            5819

##### All planetary systems by hostname from systems

In [15]:
pd.read_sql_query("""
SELECT *
FROM   planets
WHERE  hostname=(
  SELECT sy_name 
  FROM   systems
  WHERE  sy_name='14 Her'
  )
""", conn)

,pl_name,hostname,sy_snum,sy_pnum,cb_flag,disc_pubdate,last_updated
0,14 Her b,14 Her,1,2,0,2003-01,2024-12-17 11:43:50
1,HD 145675 c,14 Her,1,2,0,2021-07,2024-12-17 11:43:50

##### get most recent discovery public date

In [16]:
pd.read_sql_query("""
SELECT * FROM planets
 WHERE disc_pubdate = (
  SELECT MAX(disc_pubdate)
    FROM planets
);""", conn)

,pl_name,hostname,sy_snum,sy_pnum,cb_flag,disc_pubdate,last_updated
0,HD 86728 b,HD 86728,1,1,0,2025-01,2024-12-30 11:24:53

##### check none search

In [17]:
body_name = 'asdf'

cursor.execute(f"""
    SELECT hostname
    FROM planets
    WHERE pl_name='{body_name}';
""")
print(cursor.fetchone())

None

## Systems

### Delete

In [ ]:
# conn.execute("""DROP TABLE IF EXISTS systems""")

### Create

In [ ]:
conn.execute("""
CREATE TABLE systems (
    sy_name TEXT PRIMARY KEY NOT NULL,
    sy_snum INTEGER,
    sy_pnum INTEGER,
    last_updated DATETIME DEFAULT current_timestamp
);
""")

### UPSERT

In [ ]:
# data_to_insert = []
# for _, row in old_hosts.iterrows():
#     data_to_insert.append((
#         row['sy_name'],
#         row['sy_snum'],
#         row['sy_pnum'],
#     ))

# conn.executemany(f"""
#     INSERT INTO systems (sy_name, sy_snum, sy_pnum, last_updated)
#     VALUES (?, ?, ?, current_timestamp)
#     ON CONFLICT(sy_name)
#     DO UPDATE SET
#         sy_name = CASE WHEN excluded.sy_name != systems.sy_name THEN excluded.sy_name ELSE systems.sy_name END,
#         sy_snum = CASE WHEN excluded.sy_snum != systems.sy_snum THEN excluded.sy_snum ELSE systems.sy_snum END,
#         sy_pnum = CASE WHEN excluded.sy_pnum != systems.sy_pnum THEN excluded.sy_pnum ELSE systems.sy_pnum END,
#         last_updated = current_timestamp
#     WHERE
#         systems.sy_snum != excluded.sy_snum OR
#         systems.sy_pnum != excluded.sy_pnum;
# """, data_to_insert)

### Checks

##### Metadata

In [ ]:
pd.read_sql_query("""PRAGMA table_info('systems');""", conn)

##### All

In [ ]:
pd.read_sql_query("""SELECT * FROM systems""", conn)

##### Count

In [ ]:
pd.read_sql_query("SELECT COUNT(sy_name) FROM systems", conn)

In [ ]:
pd.read_sql_query("""            
    SELECT *
    FROM systems
    WHERE last_updated = (
        SELECT MAX(last_updated)
        FROM systems
    );
""", conn)

In [ ]:
pd.read_sql_query("""
            SELECT *
            FROM planets
            WHERE last_updated = (
                SELECT MAX(last_updated)
                FROM planets
            )
            ORDER BY disc_pubdate;
        """, conn)

## Stellar

### Delete

### Create

In [ ]:
conn.execute("""
CREATE TABLE stellar (
    hostname TEXT PRIMARY KEY NOT NULL,
    sy_name INTEGER,
    last_updated DATETIME DEFAULT current_timestamp
);
""")

In [ ]:
conn.execute("""
    ALTER TABLE stellar
      ADD st_spectype TEXT;
""")

### UPSERT

### Spectype

In [ ]:


data_to_insert = []
for _, row in data_frame.iterrows():
data_to_insert.append((
row['st_spectype'],
row['hostname']
))
for
con.executemany("""
UPDATE stellar
SET st_spectype = %s
WHERE hostname = %s;
""", data_to_insert)

### Checks

##### Metadata

In [18]:
pd.read_sql_query("""PRAGMA table_info('stellar');""", conn)

   cid          name      type  notnull         dflt_value  pk
0    0      hostname      TEXT        1               None   1
1    1       sy_name   INTEGER        0               None   0
2    2  last_updated  DATETIME        0  current_timestamp   0
3    3   st_spectype      TEXT        0               None   0

##### All

In [ ]:
pd.read_sql_query("""SELECT * FROM stellar""", conn)

##### Count

In [ ]:
pd.read_sql_query("""SELECT COUNT(hostname) FROM stellar""", conn)

## check for tables

In [24]:
pd.read_sql_query("""SELECT name FROM sqlite_master WHERE type = 'table'""", conn)

      name
0  planets
1  systems
2  stellar

## Read planets

##### Turn SQL to CSV for reading

In [14]:
stellar = pd.read_sql("""SELECT * FROM stellar""", conn)
stellar.to_csv('../stellar_data.csv', index=False)

##### Get most recent updated systems

In [ ]:
pd.read_sql_query("""
SELECT * FROM systems
 WHERE last_updated = (
  SELECT MAX(last_updated)
    FROM systems
);""", conn)

## Commit and Close connection

In [ ]:
conn.commit()
conn.close()